import { Component } from '@angular/core';
import { RouterOutlet } from '@angular/router';
import { CommonModule } from '@angular/common';

@Component({
  selector: 'app-root',
  standalone: true,
  imports: [RouterOutlet, CommonModule],
  templateUrl: './app.component.html',
  styleUrl: './app.component.css',
})
export class AppComponent {
  homeworkTitle = 'Домашна работа № 1';
  items: {
    header: string;
    content: string;
    active: boolean;
    type?: string;
  }[] = [
    {
      header: 'Информация за вас',
      content: 'Симона Симеонова, 21г., 3 курс - Софтуерни технологии и дизайн',
      active: false,
    },
    {
      header: 'Информация за вашите хобита и интереси',
      content: `
      Моите интереси се фокусират върху здравословния начин на живот,
     като включвам правилно хранене, редовна физическа активност и грижа за 
     емоционалното благополучие. Ентусиазирана съм от изучаването на хранителни принципи,
      разнообразни видове спорт и техники за релаксация. Тези практики ме поддържат бодра и изпълнена с енергия,
       като подобряват качеството на моя живот.`,
      active: false,
    },
    {
      header:
        'Линк към материал на любим content creator, които ви е вдъхновил',
      content: 'https://www.youtube.com/@AntoanetPopova',
      active: false,
      type: 'link',
    },
    {
      header:
        'Информация за вашия канал, какво ще правите, как ще го правите и какво да очакват феновете',
      content: `В моя канал ще откриете вдъхновяващи и информативни видеа,
       посветени на здравословния начин на живот, правилното хранене,
        спорта и грижата за себе си - както физическа, така и емоционална.
         Всяко видео е създадено с любов и старание, с цел да ви помогне да постигнете оптимално благополучие и живот на пълни обороти. 
         Ще споделяме идеи за хранене, тренировки и релаксация,
          ще организираме предизвикателства и програми за подкрепа,
           както и ще провеждаме интервюта с експерти. 
           Предлагаме редовни видеа със съвети и тренировки, 
           практически ръководства и комуникация със зрителите.
            Феновете могат да очакват мотивиращи видеа, съвети и
             възможност за споделяне на опит и успехи. С нашия план,
              сме тук, за да ви подкрепим към по-здравословен и по-щастлив живот!`,
      active: false,
    },
    {
      header: 'Примерно остойностяване на вашите услуги',
      content: `Ценността на моят канал произтича от моето 
      стремежно желание да ви вдъхновявам и подкрепям в пътя
       ви към по-здравословен начин на живот. Съчетавайки практически
        съвети, мотивиращи видеа и възможности за общуване, моят канал
         предлага ценни ресурси за всички, които търсят промяна към по-пълноценен начин на живот.`,
      active: false,
    },
  ];

  openAccordion(header: string) {
    this.items = this.items.map((item) => {
      if (header === item.header) item.active = !item.active;
      else item.active = false;

      return item;
    });
  }
}
